{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.3.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 17, 8, 8], "dtype": "float32", "sparse": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "89_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "89_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "89", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "89", "inbound_nodes": [[["89_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "90", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "90", "inbound_nodes": [[["89", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "91", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "91", "inbound_nodes": [[["90", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "92_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "92_pad", "inbound_nodes": [[["91", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "92", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "92", "inbound_nodes": [[["92_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "93", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "93", "inbound_nodes": [[["92", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "94", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "94", "inbound_nodes": [[["93", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "95_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "95_pad", "inbound_nodes": [[["94", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "95", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "95", "inbound_nodes": [[["95_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "96", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "96", "inbound_nodes": [[["95", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "97", "trainable": true, "dtype": "float32"}, "name": "97", "inbound_nodes": [[["96", 0, 0, {}], ["91", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "98", "inbound_nodes": [[["97", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "99_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "99_pad", "inbound_nodes": [[["98", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "99", "inbound_nodes": [[["99_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "100", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "100", "inbound_nodes": [[["99", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "101", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "101", "inbound_nodes": [[["100", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "102_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "102_pad", "inbound_nodes": [[["101", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "102", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "102", "inbound_nodes": [[["102_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "103", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "103", "inbound_nodes": [[["102", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "104", "trainable": true, "dtype": "float32"}, "name": "104", "inbound_nodes": [[["103", 0, 0, {}], ["98", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "105", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "105", "inbound_nodes": [[["104", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "106_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "106_pad", "inbound_nodes": [[["105", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "106", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "106", "inbound_nodes": [[["106_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "107", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "107", "inbound_nodes": [[["106", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "108", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "108", "inbound_nodes": [[["107", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "109_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "109_pad", "inbound_nodes": [[["108", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "109", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "109", "inbound_nodes": [[["109_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "110", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "110", "inbound_nodes": [[["109", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "111", "trainable": true, "dtype": "float32"}, "name": "111", "inbound_nodes": [[["110", 0, 0, {}], ["105", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "112", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "112", "inbound_nodes": [[["111", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "113_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "113_pad", "inbound_nodes": [[["112", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "113", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "113", "inbound_nodes": [[["113_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "114", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "114", "inbound_nodes": [[["113", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "115", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "115", "inbound_nodes": [[["114", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "116_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "116_pad", "inbound_nodes": [[["115", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "116", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "116", "inbound_nodes": [[["116_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "117", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "117", "inbound_nodes": [[["116", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "118", "trainable": true, "dtype": "float32"}, "name": "118", "inbound_nodes": [[["117", 0, 0, {}], ["112", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "119", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "119", "inbound_nodes": [[["118", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "120_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "120_pad", "inbound_nodes": [[["119", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "120", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "120", "inbound_nodes": [[["120_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "121", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "121", "inbound_nodes": [[["120", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "122", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "122", "inbound_nodes": [[["121", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "123_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "123_pad", "inbound_nodes": [[["122", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "123", "inbound_nodes": [[["123_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "124", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "124", "inbound_nodes": [[["123", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "125", "trainable": true, "dtype": "float32"}, "name": "125", "inbound_nodes": [[["124", 0, 0, {}], ["119", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "126", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "126", "inbound_nodes": [[["125", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "127_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "127_pad", "inbound_nodes": [[["126", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "127", "inbound_nodes": [[["127_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "128", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "128", "inbound_nodes": [[["127", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "129", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "129", "inbound_nodes": [[["128", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "130_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "130_pad", "inbound_nodes": [[["129", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "130", "inbound_nodes": [[["130_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "131", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "131", "inbound_nodes": [[["130", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "132", "trainable": true, "dtype": "float32"}, "name": "132", "inbound_nodes": [[["131", 0, 0, {}], ["126", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "133", "inbound_nodes": [[["132", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "134", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "134", "inbound_nodes": [[["133", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "135", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "135", "inbound_nodes": [[["134", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "136", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "136", "inbound_nodes": [[["135", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "144", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "144", "inbound_nodes": [[["136", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "145", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "145", "inbound_nodes": [[["144", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "146", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "146", "inbound_nodes": [[["145", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "147", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "147", "inbound_nodes": [[["146", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "output_0", "inbound_nodes": [[["147", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "100_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "100_1/beta", "shape": [64], "dtype": "float32"}, {"name": "100_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "100_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "102_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "103_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "103_1/beta", "shape": [64], "dtype": "float32"}, {"name": "103_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "103_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "106_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "107_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "107_1/beta", "shape": [64], "dtype": "float32"}, {"name": "107_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "107_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "109_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "110_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "110_1/beta", "shape": [64], "dtype": "float32"}, {"name": "110_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "110_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "113_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "114_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "114_1/beta", "shape": [64], "dtype": "float32"}, {"name": "114_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "114_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "116_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "117_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "117_1/beta", "shape": [64], "dtype": "float32"}, {"name": "117_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "117_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "120_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "121_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "121_1/beta", "shape": [64], "dtype": "float32"}, {"name": "121_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "121_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "123_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "124_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "124_1/beta", "shape": [64], "dtype": "float32"}, {"name": "124_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "124_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "127_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "128_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "128_1/beta", "shape": [64], "dtype": "float32"}, {"name": "128_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "128_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "130_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "131_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "131_1/beta", "shape": [64], "dtype": "float32"}, {"name": "131_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "131_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "134_1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "135_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "135_1/beta", "shape": [32], "dtype": "float32"}, {"name": "135_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "135_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "145_1/kernel", "shape": [2048, 128], "dtype": "float32"}, {"name": "145_1/bias", "shape": [128], "dtype": "float32"}, {"name": "147_1/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "147_1/bias", "shape": [1], "dtype": "float32"}, {"name": "89_1/kernel", "shape": [3, 3, 17, 64], "dtype": "float32"}, {"name": "90_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "90_1/beta", "shape": [64], "dtype": "float32"}, {"name": "90_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "90_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "92_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "93_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "93_1/beta", "shape": [64], "dtype": "float32"}, {"name": "93_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "93_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "95_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "96_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "96_1/beta", "shape": [64], "dtype": "float32"}, {"name": "96_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "96_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "99_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}]}]}